attic/logs/qwen3-std-bench-3145754.log
START TIME : 2026-08-22T00:59:44+02:00
nodes      : nid[006856,007437] (head nid006856, ray 30754, serve 23754)
model      : Qwen/Qwen3-30B-A3B  TP=1 DP=8 EP=8 via ray (8 GPUs, 4 replicas/node)
bench      : random dataset seed=42, in=1024 out=512, 300 prompts x 2 passes
output     : /iopsstor/scratch/cscs/mvasilev/vllm-play/qwen3-std-results/bench-dp8-prewarm-3145754
0: 2026-08-22 00:59:52,715	INFO usage_lib.py:448 -- Usage stats collection is disabled.
0: 2026-08-22 00:59:52,716	INFO scripts.py:1042 -- Local node IP: 172.28.35.240
0: 2026-08-22 00:59:56,068	SUCC scripts.py:1081 -- --------------------
0: 2026-08-22 00:59:56,069	SUCC scripts.py:1082 -- Ray runtime started.
0: 2026-08-22 00:59:56,069	SUCC scripts.py:1083 -- --------------------
0: 2026-08-22 00:59:56,069	INFO scripts.py:1085 -- Next steps
0: 2026-08-22 00:59:56,069	INFO cli_output_helpers.py:16 -- Note: The following commands are intended for use on
0: 2026-08-22 00:59:56,069	INFO cli_output_helpers.py:17 -- the head node or within the cluster network.
0: 2026-08-22 00:59:56,069	INFO scripts.py:1089 -- To add another node to this Ray cluster, run
0: 2026-08-22 00:59:56,069	INFO scripts.py:1092 --   ray start --address='172.28.35.240:30754'
0: 2026-08-22 00:59:56,069	INFO scripts.py:1103 -- To connect to this Ray cluster:
0: 2026-08-22 00:59:56,069	INFO scripts.py:1105 -- import ray
0: 2026-08-22 00:59:56,069	INFO scripts.py:1106 -- ray.init()
0: 2026-08-22 00:59:56,069	INFO scripts.py:1139 -- To terminate the Ray runtime, run
0: 2026-08-22 00:59:56,069	INFO scripts.py:1140 --   ray stop
0: 2026-08-22 00:59:56,069	INFO scripts.py:1143 -- To view the status of the cluster, use
0: 2026-08-22 00:59:56,069	INFO scripts.py:1144 --   ray status
0: 
1: 2026-08-22 00:59:58,332	INFO scripts.py:1231 -- Local node IP: 172.28.43.180
1: 2026-08-22 01:00:00,937	SUCC scripts.py:1247 -- --------------------
1: 2026-08-22 01:00:00,937	SUCC scripts.py:1248 -- Ray runtime started.
1: 2026-08-22 01:00:00,937	SUCC scripts.py:1249 -- --------------------
1: 2026-08-22 01:00:00,937	INFO scripts.py:1251 -- To terminate the Ray runtime, run
1: 2026-08-22 01:00:00,937	INFO scripts.py:1252 --   ray stop
1: 
0: ray cluster up: 8 GPUs
0: SERVE HEALTHY after startup (attempt 1)
0: ===== BENCH PASS 1 =====
0: Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x4005d3e21c60>, trust_remote_code=False, seed=42, num_prompts=300, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=512, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False,
0:  random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url=None, host='127.0.0.1', port=23754, endpoint='/v1/completions', header=None, max_concurrency=512, model='Qwen/Qwen3-30B-A3B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/iopssto
0: r/scratch/cscs/mvasilev/vllm-play/qwen3-std-results/bench-dp8-prewarm-3145754', result_filename='bench_pass1.json', ignore_eos=False, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-537c9bf0-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
0: INFO 08-22 01:03:29 [utils.py:90] Sampling input_len from [1024, 1024] and output_len from [512, 512]
0: WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
0: Starting initial single prompt test run...
0: Skipping endpoint ready check.
0: Starting main benchmark run...
0: Traffic request rate: inf
0: Burstiness factor: 1.0 (Poisson process)
0: Maximum request concurrency: 512
  0%|          | 0/300 [00:00<?, ?it/s]
  0%|          | 1/300 [00:17<1:26:03, 17.27s/it]
 59%|█████▉    | 178/300 [00:17<00:08, 14.58it/s]
100%|██████████| 300/300 [00:17<00:00, 17.24it/s]
0: tip: install termplotlib and gnuplot to plot the metrics
0: ============ Serving Benchmark Result ============
0: Successful requests:                     300       
0: Failed requests:                         0         
0: Maximum request concurrency:             512       
0: Benchmark duration (s):                  17.40     
0: Total input tokens:                      307200    
0: Total generated tokens:                  153600    
0: Request throughput (req/s):              17.24     
0: Output token throughput (tok/s):         8826.38   
0: Peak output token throughput (tok/s):    11700.00  
0: Peak concurrent requests:                300.00    
0: Total token throughput (tok/s):          26479.13  
0: ---------------Time to First Token----------------
0: Mean TTFT (ms):                          2950.92   
0: Median TTFT (ms):                        2945.46   
0: P99 TTFT (ms):                           3982.84   
0: -----Time per Output Token (excl. 1st token)------
0: Mean TPOT (ms):                          28.13     
0: Median TPOT (ms):                        28.14     
0: P99 TPOT (ms):                           30.09     
0: ---------------Inter-token Latency----------------
0: Mean ITL (ms):                           28.13     
0: Median ITL (ms):                         25.69     
0: P99 ITL (ms):                            45.83     
0: ----------------End-to-end Latency----------------
0: Mean E2EL (ms):                          17326.70  
0: Median E2EL (ms):                        17327.21  
0: P99 E2EL (ms):                           17367.34  
0: ==================================================
0: BENCH_PASS_1_WALL_SECONDS 33
0: ===== BENCH PASS 2 =====
0: Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x4005a8bdc680>, trust_remote_code=False, seed=42, num_prompts=300, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=512, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False,
0:  random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url=None, host='127.0.0.1', port=23754, endpoint='/v1/completions', header=None, max_concurrency=512, model='Qwen/Qwen3-30B-A3B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/iopssto
0: r/scratch/cscs/mvasilev/vllm-play/qwen3-std-results/bench-dp8-prewarm-3145754', result_filename='bench_pass2.json', ignore_eos=False, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-7e2053ae-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
0: INFO 08-22 01:04:02 [utils.py:90] Sampling input_len from [1024, 1024] and output_len from [512, 512]
0: WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
0: Starting initial single prompt test run...
0: Skipping endpoint ready check.
0: Starting main benchmark run...
0: Traffic request rate: inf
0: Burstiness factor: 1.0 (Poisson process)
0: Maximum request concurrency: 512
  0%|          | 0/300 [00:00<?, ?it/s]
  0%|          | 1/300 [00:15<1:17:35, 15.57s/it]
  1%|          | 2/300 [00:15<32:21,  6.52s/it]  
  1%|          | 3/300 [00:15<18:00,  3.64s/it]
 36%|███▌      | 108/300 [00:16<00:10, 18.76it/s]
100%|██████████| 300/300 [00:16<00:00, 18.64it/s]
0: tip: install termplotlib and gnuplot to plot the metrics
0: ============ Serving Benchmark Result ============
0: Successful requests:                     300       
0: Failed requests:                         0         
0: Maximum request concurrency:             512       
0: Benchmark duration (s):                  16.10     
0: Total input tokens:                      307200    
0: Total generated tokens:                  153600    
0: Request throughput (req/s):              18.64     
0: Output token throughput (tok/s):         9541.28   
0: Peak output token throughput (tok/s):    11700.00  
0: Peak concurrent requests:                300.00    
0: Total token throughput (tok/s):          28623.85  
0: ---------------Time to First Token----------------
0: Mean TTFT (ms):                          1878.47   
0: Median TTFT (ms):                        1897.28   
0: P99 TTFT (ms):                           2777.77   
0: -----Time per Output Token (excl. 1st token)------
0: Mean TPOT (ms):                          27.71     
0: Median TPOT (ms):                        27.69     
0: P99 TPOT (ms):                           30.25     
0: ---------------Inter-token Latency----------------
0: Mean ITL (ms):                           27.71     
0: Median ITL (ms):                         25.72     
0: P99 ITL (ms):                            42.67     
0: ----------------End-to-end Latency----------------
0: Mean E2EL (ms):                          16038.07  
0: Median E2EL (ms):                        16044.23  
0: P99 E2EL (ms):                           16068.80  
0: ==================================================
0: BENCH_PASS_2_WALL_SECONDS 31
0: 2026-08-22 01:04:23,888	VINFO scripts.py:1418 -- Send termination request to `/iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/lib/python3.12/site-packages/ray/core/src/ray/raylet/raylet --raylet_socket_name=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/sockets/raylet --store_socket_name=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/sockets/plasma_store --object_manager_port=0 --min_worker_port=10002 --max_worker_port=19999 --node_manager_port=0 --node_id=f6a4f1a855bccae87568bda64224266e7ace681da41a19ef7f77707d --node_ip_address=172.28.35.240 --maximum_startup_concurrency=288 --static_resource_list=node:172.28.35.240,1.0,node:__internal_head__,1.0,accelerator_type:GH200,1,CPU,288,GPU,4,memory,336149059994,object_store_memory,144063882854 "--python_worker_command=/iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/bin/python3 /iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/lib/python3.12/site-packages/ray/_private/workers/setup_worker.py -s /iopsstor/scratch/cscs/mvasilev
0: /vllm-play/lmeval-std-venv/lib/python3.12/site-packages/ray/_private/workers/default_worker.py --node-ip-address=172.28.35.240 --node-manager-port=RAY_NODE_MANAGER_PORT_PLACEHOLDER --object-store-name=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/sockets/plasma_store --raylet-name=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/sockets/raylet --redis-address=None --metrics-agent-port=0 --logging-rotate-bytes=536870912 --logging-rotate-backup-count=5 --runtime-env-agent-port=0 --gcs-address=172.28.35.240:30754 --session-name=session_2026-08-22_00-59-52_716602_221080 --temp-dir=/tmp/ray --webui= --cluster-id=53437d389a7aad0edacdaa56bda5fa585009af99e32f86ba9f56ba47 RAY_WORKER_DYNAMIC_OPTION_PLACEHOLDER" --java_worker_command= --cpp_worker_command= --native_library_path=/iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/lib/python3.12/site-packages/ray/cpp/lib --temp_dir=/tmp/ray --session_dir=/tmp/ray/session_2026-08-22_00-59-52_716602_221080 --log_dir=/tmp/ray/session_2026-08-22_00-59-52_716602_2
0: 21080/logs --resource_dir=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/runtime_resources --metrics-agent-port=0 --metrics_export_port=0 --runtime_env_agent_port=0 --object_store_memory=144063882854 --plasma_directory=/dev/shm --fallback_directory=/tmp/ray/session_2026-08-22_00-59-52_716602_221080 --ray-debugger-external=0 --gcs-address=172.28.35.240:30754 --session-name=session_2026-08-22_00-59-52_716602_221080 "--labels={\"ray.io/accelerator-type\": \"GH200\"}" --cluster-id=53437d389a7aad0edacdaa56bda5fa585009af99e32f86ba9f56ba47 --stdout_filepath=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/logs/raylet.out --stderr_filepath=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/logs/raylet.err --head --num_prestart_python_workers=288 "--dashboard_agent_command=/iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/bin/python3 -u /iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/lib/python3.12/site-packages/ray/dashboard/agent.py --node-id=f6a4f1a855bccae87568bda64224266e7ace681da41a19ef7f
0: 77707d --node-ip-address=172.28.35.240 --metrics-export-port=0 --grpc-port=0 --listen-port=52365 --node-manager-port=RAY_NODE_MANAGER_PORT_PLACEHOLDER --object-store-name=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/sockets/plasma_store --raylet-name=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/sockets/raylet --temp-dir=/tmp/ray --session-dir=/tmp/ray/session_2026-08-22_00-59-52_716602_221080 --log-dir=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/logs --logging-rotate-bytes=536870912 --logging-rotate-backup-count=5 --session-name=session_2026-08-22_00-59-52_716602_221080 --gcs-address=172.28.35.240:30754 --cluster-id-hex=53437d389a7aad0edacdaa56bda5fa585009af99e32f86ba9f56ba47 --stdout-filepath=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/logs/dashboard_agent.out --stderr-filepath=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/logs/dashboard_agent.err --logging-filename=dashboard_agent.log --head" "--runtime_env_agent_command=/iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-ve
0: nv/bin/python3 -u /iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/lib/python3.12/site-packages/ray/_private/runtime_env/agent/main.py --node-id=f6a4f1a855bccae87568bda64224266e7ace681da41a19ef7f77707d --node-ip-address=172.28.35.240 --runtime-env-agent-port=0 --session-dir=/tmp/ray/session_2026-08-22_00-59-52_716602_221080 --gcs-address=172.28.35.240:30754 --cluster-id-hex=53437d389a7aad0edacdaa56bda5fa585009af99e32f86ba9f56ba47 --runtime-env-dir=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/runtime_resources --logging-rotate-bytes=536870912 --logging-rotate-backup-count=5 --log-dir=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/logs --temp-dir=/tmp/ray --stdout-filepath=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/logs/runtime_env_agent.out --stderr-filepath=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/logs/runtime_env_agent.err --logging-filename=runtime_env_agent.log"` (via SIGTERM)
0: 2026-08-22 01:04:24,100	INFO scripts.py:1448 -- 1/1 stopped.
0: 2026-08-22 01:04:24,444	VINFO scripts.py:1418 -- Send termination request to `/iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/bin/python3 -u /iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/lib/python3.12/site-packages/ray/autoscaler/_private/monitor.py --logs-dir=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/logs --logging-rotate-bytes=536870912 --logging-rotate-backup-count=5 --gcs-address=172.28.35.240:30754 --stdout-filepath=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/logs/monitor.out --stderr-filepath=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/logs/monitor.err --monitor-ip=172.28.35.240` (via SIGTERM)
0: 2026-08-22 01:04:24,444	VINFO scripts.py:1418 -- Send termination request to `/iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/bin/python3 -u /iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/lib/python3.12/site-packages/ray/_private/log_monitor.py --session-dir=/tmp/ray/session_2026-08-22_00-59-52_716602_221080 --logs-dir=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/logs --gcs-address=172.28.35.240:30754 --node-ip-address=172.28.35.240 --logging-rotate-bytes=536870912 --logging-rotate-backup-count=5 --stdout-filepath=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/logs/log_monitor.out --stderr-filepath=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/logs/log_monitor.err` (via SIGTERM)
0: 2026-08-22 01:04:24,446	VINFO scripts.py:1418 -- Send termination request to `/iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/bin/python3 -m ray.util.client.server --address=172.28.35.240:30754 --host=172.28.35.240 --port=10001 --mode=proxy --runtime-env-agent-address=http://172.28.35.240:0 --node-id=f6a4f1a855bccae87568bda64224266e7ace681da41a19ef7f77707d` (via SIGTERM)
0: 2026-08-22 01:04:24,450	VINFO scripts.py:1426 -- Attempted to stop `/iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/bin/python3 -u /iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/lib/python3.12/site-packages/ray/_private/log_monitor.py --session-dir=/tmp/ray/session_2026-08-22_00-59-52_716602_221080 --logs-dir=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/logs --gcs-address=172.28.35.240:30754 --node-ip-address=172.28.35.240 --logging-rotate-bytes=536870912 --logging-rotate-backup-count=5 --stdout-filepath=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/logs/log_monitor.out --stderr-filepath=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/logs/log_monitor.err`, but process was already dead.
0: 2026-08-22 01:04:24,453	VINFO scripts.py:1418 -- Send termination request to `/iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/bin/python3 /iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/lib/python3.12/site-packages/ray/dashboard/dashboard.py --host=127.0.0.1 --port=8265 --port-retries=0 --temp-dir=/tmp/ray --log-dir=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/logs --session-dir=/tmp/ray/session_2026-08-22_00-59-52_716602_221080 --logging-rotate-bytes=536870912 --logging-rotate-backup-count=5 --gcs-address=172.28.35.240:30754 --cluster-id-hex=53437d389a7aad0edacdaa56bda5fa585009af99e32f86ba9f56ba47 --node-ip-address=172.28.35.240 --proxy-server-url= --stdout-filepath=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/logs/dashboard.out --stderr-filepath=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/logs/dashboard.err --modules-to-load=UsageStatsHead --disable-frontend` (via SIGTERM)
0: 2026-08-22 01:04:24,706	INFO scripts.py:1448 -- 1/4 stopped.
0: 2026-08-22 01:04:24,706	INFO scripts.py:1448 -- 2/4 stopped.
0: 2026-08-22 01:04:24,706	INFO scripts.py:1448 -- 3/4 stopped.
0: 2026-08-22 01:04:25,016	INFO scripts.py:1448 -- 4/4 stopped.
0: 2026-08-22 01:04:25,347	VINFO scripts.py:1418 -- Send termination request to `/iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/lib/python3.12/site-packages/ray/core/src/ray/gcs/gcs_server --log_dir=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/logs --config_list=eyJhdXRvbWF0aWNfb2JqZWN0X3NwaWxsaW5nX2VuYWJsZWQiOiB0cnVlLCAib2JqZWN0X3NwaWxsaW5nX2NvbmZpZyI6ICJ7XCJ0eXBlXCI6IFwiZmlsZXN5c3RlbVwiLCBcInBhcmFtc1wiOiB7XCJkaXJlY3RvcnlfcGF0aFwiOiBcIi90bXAvcmF5L3Nlc3Npb25fMjAyNi0wOC0yMl8wMC01OS01Ml83MTY2MDJfMjIxMDgwXCJ9fSIsICJpc19leHRlcm5hbF9zdG9yYWdlX3R5cGVfZnMiOiB0cnVlfQ== --gcs_server_port=30754 --metrics-agent-port=0 --node-ip-address=172.28.35.240 --session-name=session_2026-08-22_00-59-52_716602_221080 --ray-commit=4464bbb6e21bce4893ed3396b2e33996188d511d --session-dir=/tmp/ray/session_2026-08-22_00-59-52_716602_221080 --node-id=f6a4f1a855bccae87568bda64224266e7ace681da41a19ef7f77707d --stdout_filepath=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/logs/gcs_server.out --stderr_filepath=/tmp/ray/
0: session_2026-08-22_00-59-52_716602_221080/logs/gcs_server.err` (via SIGTERM)
1: 2026-08-22 01:04:28,201	VINFO scripts.py:1418 -- Send termination request to `/iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/lib/python3.12/site-packages/ray/core/src/ray/raylet/raylet --raylet_socket_name=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/sockets/raylet --store_socket_name=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/sockets/plasma_store --object_manager_port=0 --min_worker_port=10002 --max_worker_port=19999 --node_manager_port=0 --node_id=aac79d13ed802f030b00864b06616752d21f3850a095d33f595728eb --node_ip_address=172.28.43.180 --maximum_startup_concurrency=288 --static_resource_list=node:172.28.43.180,1.0,accelerator_type:GH200,1,CPU,288,GPU,4,memory,337303692903,object_store_memory,144558725529 "--python_worker_command=/iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/bin/python3 /iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/lib/python3.12/site-packages/ray/_private/workers/setup_worker.py -s /iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/
1: lib/python3.12/site-packages/ray/_private/workers/default_worker.py --node-ip-address=172.28.43.180 --node-manager-port=RAY_NODE_MANAGER_PORT_PLACEHOLDER --object-store-name=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/sockets/plasma_store --raylet-name=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/sockets/raylet --redis-address=None --metrics-agent-port=0 --logging-rotate-bytes=536870912 --logging-rotate-backup-count=5 --runtime-env-agent-port=0 --gcs-address=nid006856:30754 --session-name=session_2026-08-22_00-59-52_716602_221080 --temp-dir=/tmp/ray --webui= --cluster-id=53437d389a7aad0edacdaa56bda5fa585009af99e32f86ba9f56ba47 RAY_WORKER_DYNAMIC_OPTION_PLACEHOLDER" --java_worker_command= --cpp_worker_command= --native_library_path=/iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/lib/python3.12/site-packages/ray/cpp/lib --temp_dir=/tmp/ray --session_dir=/tmp/ray/session_2026-08-22_00-59-52_716602_221080 --log_dir=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/logs --resource_dir=/tmp/
1: ray/session_2026-08-22_00-59-52_716602_221080/runtime_resources --metrics-agent-port=0 --metrics_export_port=0 --runtime_env_agent_port=0 --object_store_memory=144558725529 --plasma_directory=/dev/shm --fallback_directory=/tmp/ray/session_2026-08-22_00-59-52_716602_221080 --ray-debugger-external=0 --gcs-address=nid006856:30754 --session-name=session_2026-08-22_00-59-52_716602_221080 "--labels={\"ray.io/accelerator-type\": \"GH200\"}" --cluster-id=53437d389a7aad0edacdaa56bda5fa585009af99e32f86ba9f56ba47 --stdout_filepath=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/logs/raylet.out --stderr_filepath=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/logs/raylet.err --num_prestart_python_workers=288 "--dashboard_agent_command=/iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/bin/python3 -u /iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/lib/python3.12/site-packages/ray/dashboard/agent.py --node-id=aac79d13ed802f030b00864b06616752d21f3850a095d33f595728eb --node-ip-address=172.28.43.180 --m
1: etrics-export-port=0 --grpc-port=0 --listen-port=52365 --node-manager-port=RAY_NODE_MANAGER_PORT_PLACEHOLDER --object-store-name=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/sockets/plasma_store --raylet-name=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/sockets/raylet --temp-dir=/tmp/ray --session-dir=/tmp/ray/session_2026-08-22_00-59-52_716602_221080 --log-dir=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/logs --logging-rotate-bytes=536870912 --logging-rotate-backup-count=5 --session-name=session_2026-08-22_00-59-52_716602_221080 --gcs-address=nid006856:30754 --cluster-id-hex=53437d389a7aad0edacdaa56bda5fa585009af99e32f86ba9f56ba47 --stdout-filepath=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/logs/dashboard_agent.out --stderr-filepath=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/logs/dashboard_agent.err --logging-filename=dashboard_agent.log" "--runtime_env_agent_command=/iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/bin/python3 -u /iopsstor/scratch/cscs/mvasilev/vll
1: m-play/lmeval-std-venv/lib/python3.12/site-packages/ray/_private/runtime_env/agent/main.py --node-id=aac79d13ed802f030b00864b06616752d21f3850a095d33f595728eb --node-ip-address=172.28.43.180 --runtime-env-agent-port=0 --session-dir=/tmp/ray/session_2026-08-22_00-59-52_716602_221080 --gcs-address=nid006856:30754 --cluster-id-hex=53437d389a7aad0edacdaa56bda5fa585009af99e32f86ba9f56ba47 --runtime-env-dir=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/runtime_resources --logging-rotate-bytes=536870912 --logging-rotate-backup-count=5 --log-dir=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/logs --temp-dir=/tmp/ray --stdout-filepath=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/logs/runtime_env_agent.out --stderr-filepath=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/logs/runtime_env_agent.err --logging-filename=runtime_env_agent.log"` (via SIGTERM)
0: 2026-08-22 01:04:30,698	WARN scripts.py:1495 -- Stopped only 5 out of 6 Ray processes within the grace period 16 seconds. Set `-v` to see more details. Remaining processes [psutil.Process(pid=221160, name='gcs_server', status='terminated')] will be forcefully terminated.
0: 2026-08-22 01:04:30,698	WARN scripts.py:1502 -- You can also use `--force` to forcefully terminate processes or set higher `--grace-period` to wait longer time for proper termination.
0: 
1: 2026-08-22 01:04:33,871	VINFO scripts.py:1418 -- Send termination request to `/iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/bin/python3 -u /iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/lib/python3.12/site-packages/ray/_private/log_monitor.py --session-dir=/tmp/ray/session_2026-08-22_00-59-52_716602_221080 --logs-dir=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/logs --gcs-address=nid006856:30754 --node-ip-address=172.28.43.180 --logging-rotate-bytes=536870912 --logging-rotate-backup-count=5 --stdout-filepath=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/logs/log_monitor.out --stderr-filepath=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/logs/log_monitor.err` (via SIGTERM)
1: 2026-08-22 01:04:33,876	VINFO scripts.py:1418 -- Send termination request to `ray::DashboardAgent "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "
1: " "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" ""
1:  "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" 
1: "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" ""` (via SIGTERM)
1: 2026-08-22 01:04:33,876	VINFO scripts.py:1418 -- Send termination request to `ray::RuntimeEnvAgent "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" 
1: "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "
1: " "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" ""` (via SIGTERM)
1: 2026-08-22 01:04:33,879	VINFO scripts.py:1426 -- Attempted to stop `/iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/bin/python3 -u /iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/lib/python3.12/site-packages/ray/_private/log_monitor.py --session-dir=/tmp/ray/session_2026-08-22_00-59-52_716602_221080 --logs-dir=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/logs --gcs-address=nid006856:30754 --node-ip-address=172.28.43.180 --logging-rotate-bytes=536870912 --logging-rotate-backup-count=5 --stdout-filepath=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/logs/log_monitor.out --stderr-filepath=/tmp/ray/session_2026-08-22_00-59-52_716602_221080/logs/log_monitor.err`, but process was already dead.
1: 2026-08-22 01:04:33,881	VINFO scripts.py:1418 -- Send termination request to `ray::DashboardAgent "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "
1: " "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" ""
1:  "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" 
1: "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" ""` (via SIGTERM)
1: 2026-08-22 01:04:33,884	VINFO scripts.py:1418 -- Send termination request to `ray::RuntimeEnvAgent "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" 
1: "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "
1: " "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" "" ""` (via SIGTERM)
1: 2026-08-22 01:04:34,553	INFO scripts.py:1448 -- 1/3 stopped.
1: 2026-08-22 01:04:39,539	WARN scripts.py:1495 -- Stopped only 1 out of 4 Ray processes within the grace period 16 seconds. Set `-v` to see more details. Remaining processes [psutil.Process(pid=228892, name='raylet', status='terminated'), psutil.Process(pid=228964, name='ray::DashboardAgent', status='terminated'), psutil.Process(pid=228967, name='ray::RuntimeEnvAgent', status='terminated')] will be forcefully terminated.
1: 2026-08-22 01:04:39,539	WARN scripts.py:1502 -- You can also use `--force` to forcefully terminate processes or set higher `--grace-period` to wait longer time for proper termination.
1: 
END TIME   : 2026-08-22T01:04:40+02:00  rc=0